emsesp/EMS-ESP32/src/core/system.cpp
// initialize a list of valid GPIOs based on the ESP32 board
// note: we always allow 0, which is used to indicate Dallas or LED is disabled
void System::set_valid_system_gpios() {
    valid_system_gpios_.clear(); // reset system list
    used_gpios_.clear();         // reset used list

    // get free gpios based on board/platform type
#if CONFIG_IDF_TARGET_ESP32C3
    // https://www.wemos.cc/en/latest/c3/c3_mini.html
    valid_system_gpios_ = string_range_to_vector("0-10"); // UART0=20,21
#elif CONFIG_IDF_TARGET_ESP32S2
    // 43 and 44 are UART0 pins
    // 38 and 39 are strapping pins, input only
    valid_system_gpios_ = string_range_to_vector("0-14, 19, 20, 21, 33-37, 45, 46");
#elif CONFIG_IDF_TARGET_ESP32S3
    // 43 and 44 are UART0 pins
    // 33-37 for Octal SPI (SPIIO4 through SPIIO7 and SPIDQS)
    // 38 and 39 are input only
    // 45 and 36 are strapping pins, input only
    valid_system_gpios_ = string_range_to_vector("0-14, 17, 18, 21, 33-39, 45, 46");
#elif CONFIG_IDF_TARGET_ESP32
    // 1 and 3 are UART0 pins, but used for some eth-boards (BBQKees-E32, OlimexPOE)
    // 32-39 is ADC1, input only
    if (ESP.getPsramSize() > 0) {
        // if psram is enabled remove pins 16 and 17 from the list
        valid_system_gpios_ = string_range_to_vector("0-5, 12-15, 18-19, 23, 25-27, 32-39");
    } else {
        valid_system_gpios_ = string_range_to_vector("0-5, 12-19, 23, 25-27, 32-39");
    }
#elif defined(EMSESP_STANDALONE)
    valid_system_gpios_ = string_range_to_vector("0-5, 12-19, 23, 25-27, 32-39");
#endif
}

// check if a pin is valid ESP32 pin and if not already used, add to the used gpio list
// return false if not allowed or already used
bool System::add_gpio(uint8_t pin, const char * source_name) {
    // check if this is a valid user GPIO
    if (std::find(valid_system_gpios_.begin(), valid_system_gpios_.end(), pin) != valid_system_gpios_.end()) {
        // It's valid now check if it's already in the used list
        if (std::find(used_gpios_.begin(), used_gpios_.end(), pin) != used_gpios_.end()) {
            LOG_WARNING("GPIO %d for %s is already in use", pin, source_name);
            return false; // Pin is already used
        }
    } else {
        // not valid
        LOG_WARNING("GPIO %d for %s is not valid", pin, source_name);
        return false;
    }

    // remove the old pin, if exists from used list
    remove_gpio(pin);

    LOG_DEBUG("Adding GPIO %d for %s to used gpio list", pin, source_name);
    used_gpios_.push_back(pin); // add to used list

    return true;
}

// remove a gpio from both valid and used lists
void System::remove_gpio(uint8_t pin, bool also_system) {
    auto it = std::find(used_gpios_.begin(), used_gpios_.end(), pin);
    if (it != used_gpios_.end()) {
        LOG_DEBUG("GPIO %d removed from used gpio list", pin);
        used_gpios_.erase(it);
    }

    if (also_system) {
        it = std::find(valid_system_gpios_.begin(), valid_system_gpios_.end(), pin);
        if (it != valid_system_gpios_.end()) {
            LOG_DEBUG("GPIO %d removed from valid gpio list", pin);
            valid_system_gpios_.erase(it);
        }
    }
}

// return a list of GPIO's available for use
std::vector<uint8_t> System::available_gpios() {
    std::vector<uint8_t> gpios;
    for (const auto & gpio : valid_system_gpios_) {
        if (std::find(used_gpios_.begin(), used_gpios_.end(), gpio) == used_gpios_.end()) {
            gpios.push_back(gpio); // didn't find it in used_gpios_, so it's available
        }
    }
    return gpios;
}

// make a snapshot of the current GPIOs
void System::make_snapshot_gpios() {
    snapshot_used_gpios_.clear();
    for (const auto & gpio : used_gpios_) {
        snapshot_used_gpios_.push_back(gpio);
    }

    snapshot_valid_system_gpios_.clear();
    for (const auto & gpio : valid_system_gpios_) {
        snapshot_valid_system_gpios_.push_back(gpio);
    }
}

// restore the GPIOs from the snapshot
void System::restore_snapshot_gpios() {
    used_gpios_.clear();
    for (const auto & gpio : snapshot_used_gpios_) {
        used_gpios_.push_back(gpio);
    }

    valid_system_gpios_.clear();
    for (const auto & gpio : snapshot_valid_system_gpios_) {
        valid_system_gpios_.push_back(gpio);
    }

    // clear the snapshot
    clear_snapshot_gpios();
}

void System::clear_snapshot_gpios() {
    snapshot_used_gpios_.clear();
    snapshot_valid_system_gpios_.clear();
}

} // namespace emsesp
